Assertions/assertions-index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-08-07 Mon 11:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>On Assertions</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
<meta name="description" content="On Assertions in Software Engineering"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">On Assertions</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb9e996b">1. Assertions Intro</a></li>
<li><a href="#orgee52b32">2. Entry and Exit Assertions</a>
<ul>
<li><a href="#org6655564">2.1. Entry Assertions</a></li>
<li><a href="#org95aca36">2.2. Exit Assertions</a></li>
<li><a href="#orgebd60e8">2.3. Exercises</a></li>
</ul>
</li>
<li><a href="#org708af36">3. Loop Invariants</a></li>
<li><a href="#org432d6d9">4. End</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb9e996b" class="outline-2">
<h2 id="orgb9e996b"><span class="section-number-2">1</span> Assertions Intro</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Assertions: Formal or Informal</li>
<li><a href="./assertions-in-the-small.html">Tiny Examples</a> Just tiny<sup>2</sup> examples</li>
<li><a href="./practical-advice.html">Practical-Advice</a> on Assertions</li>
<li>Partial Correctness + Termination
<ol class="org-ol">
<li>Hoare's Axiomatics is only about Partial Correctness, no
termination</li>
<li>Dijkstra's Weakest Preconditions (Predicate Transformers)
include termination also</li>
<li>An Unsolved Problem (as of 2017): The <a href="./3np1.html">3n+1</a> Termination Problem</li>
</ol></li>
</ol>
</div>
</div>

<div id="outline-container-orgee52b32" class="outline-2">
<h2 id="orgee52b32"><span class="section-number-2">2</span> Entry and Exit Assertions</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Context: Methods/ Procs/ Functions</li>
</ol>
</div>

<div id="outline-container-org6655564" class="outline-3">
<h3 id="org6655564"><span class="section-number-3">2.1</span> Entry Assertions</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>An Entry Assertion ought to be true before entering a method.</li>
<li>This should be guaranteed by the caller.</li>
<li>The method assumes this.</li>
<li>It does not check it.  If it does, the Entry Assertion of the
method is simply "true".</li>
</ol>
</div>
</div>

<div id="outline-container-org95aca36" class="outline-3">
<h3 id="org95aca36"><span class="section-number-3">2.2</span> Exit Assertions</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>An Exit Assertion is guaranteed to be true just before exiting a
method.</li>
<li>This is assumed by the caller upon return.  The caller does not
[have to] check it.  If it does, the exit assertion does not
change.  Caller is merely wasting CPU cycles.</li>
</ol>
</div>
</div>

<div id="outline-container-orgebd60e8" class="outline-3">
<h3 id="orgebd60e8"><span class="section-number-3">2.3</span> Exercises</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li>Look up the man pages for a few of the C standard library methods,
and give entry + exit assertions.  E.g.,
<ol class="org-ol">
<li>Specify <code>double sqrt(double x)</code>  lookup <code>man 3 sqrt</code></li>
</ol></li>

<li>Specify Bubble Sort.</li>
<li>Does the above apply to QuickSort?</li>
<li>QuickSort uses a method often named partiton.  Spec it.</li>
<li>How do you specify that the array elements going in are the same as
that come after a sort?</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org708af36" class="outline-2">
<h2 id="org708af36"><span class="section-number-2">3</span> Loop Invariants</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>An assertion A placed at a point in a loop is an <i>invariant</i> if the
it remains true at every iteration.</li>

<li>We want the strongest loop invariant.</li>
</ol>
</div>
</div>



<div id="outline-container-org432d6d9" class="outline-2">
<h2 id="org432d6d9"><span class="section-number-2">4</span> End</h2>
<div class="outline-text-2" id="text-4">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2017 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  2017-06-10
</div>
</body>
</html>
